app/controllers/alive_controller.rb

  def index
  	@players = Player.where("is_dead = 'f'")
---
SELECT "players".* FROM "players" WHERE (player.is_dead < 1)