app/controllers/kill_controller.rb

  def show
    @player = Player.find(params[:victimid])
    respond_to do |format|
      if @player.update_attributes(:is_dead => 1)
---
SELECT "players".* FROM "players" WHERE "players"."id" = ? LIMIT 1  [["id", :victimid]]
UPDATE "players" SET "is_dead" = 't', "updated_at" = '2013-10-03 03:50:38.827032' WHERE "players"."id" = 2