app/controllers/loc_controller.rb

  def setloc
    @player = Player.find(params[:playerid])
    respond_to do |format|
      if (@player.update_attributes(:lat => params[:nlat]) && @player.update_attributes(:lon => params[:nlon]))
---
SELECT "players".* FROM "players" WHERE "players"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "players" SET "lon" = 60.0, "updated_at" = '2013-10-03 05:43:29.503293' WHERE "players"."id" = 2