app/controllers/players_controller.rb

  def edit
    @player = Player.find(params[:id])
---
SELECT "players".* FROM "players" WHERE "players"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @player = Player.new(params[:player])

    respond_to do |format|
      if @player.save
---
INSERT INTO "players" ("created_at", "is_dead", "lat", "lon", "role", "updated_at", "user_id", "votes_for") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @player = Player.find(params[:id])

    respond_to do |format|
      if @player.update_attributes(params[:player])
---
SELECT "players".* FROM "players" WHERE "players"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "players" SET "is_dead" = 't', "updated_at" = '2013-10-03 03:50:28.169422' WHERE "players"."id" = 2

  def destroy
    @player = Player.find(params[:id])
    @player.destroy
---
SELECT "players".* FROM "players" WHERE "players"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "players" WHERE "players"."id" = ?  [["id", 1]]