app/controllers/reset_controller.rb

DELETE FROM "players" WHERE "players"."id" = ?  [["id", 1]]
DELETE FROM "games" WHERE "games"."id" = ?  [["id", 1]]
SELECT "users".* FROM "users"
INSERT INTO "games" ("created_at", "interval", "start", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Thu, 03 Oct 2013 06:11:29 UTC +00:00], ["interval", 10], ["start", 2013-10-03 02:11:29 -0400], ["updated_at", Thu, 03 Oct 2013 06:11:29 UTC +00:00]]
INSERT INTO "players" ("created_at", "game_id", "is_dead", "lat", "lon", "role", "updated_at", "user_id", "votes_for") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def show
  	Player.destroy_all
  	Game.destroy_all
  	@users = User.all
  	@game = Game.new(start: Time.now, interval: params[:ninterval])
  	@game.save
    @users.each do |p|
    	player = Player.new(role: 0, user_id: p.id, game_id: @game.id)
    	player.save