app/controllers/users_controller.rb

  def index
    @users = User.all #Retrieves all users from the database
---
SELECT "users".* FROM "users"

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "is_admin", "name", "password", "pic", "player", "score", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)